Repository: naciohr/winscp-galego
Catalog: winscp-galego/winscp-galego-level1.tmx
Source language: por
Languages: glg

source: "Transferir em segundo &plano"
glg: "Transferir en segundo &plano"

source: "Transferências em segundo plano"
glg: "Transferências en segundo plano"

source: "Trava de escala de bytes em conflito."
glg: "Trava de escala de bytes en conflito."

source: "Troca de chaves baseada em RSA"
glg: "Troca de chaves baseada en RSA"

source: "Tudo (sem recursão)"
glg: "Todo (sen recursividade)"

source: "UTF-8|Codificação UTF-8"
glg: "UTF-8|Codificación UTF-8"

source: "Um dos parâmetros estava fora de ordem, ou os parâmetros especificados não podem ser usados juntos."
glg: "Um dos parâmetros estava fora de ordem, ou os parâmetros especificados não podem ser usados xuntos."

source: "Um erro ocorreu enquanto tentava copiar um arquivo:"
glg: "Um erro ocorreu enquanto tentava copiar un arquivo:"

source: "Um erro ocorreu enquanto tentava criar um arquivo no diretório destino:"
glg: "Um erro ocorreu enquanto tentava criar un arquivo no directorio destino:"

source: "Um erro ocorreu enquanto tentava renomear um arquivo no diretório destino:"
glg: "Um erro ocorreu enquanto tentava renomear un arquivo no directorio destino:"

# "Um parâmetro inválido foi passado na linha de comando: %1"
source: "Um parâmetro inválido foi passado na linha de comando:\n\n%1"
glg: "Um parâmetro inválido foi passado na liña de comando:\n\n%1"

source: "Uma documentação abrangente do WinSCP e um fórum de utilizadores ativos estão disponíveis gratuitamente no site do WinSCP"
glg: "Uma documentação abrangente do WinSCP e un fórum de utilizadores ativos estão disponíveis gratuitamente no site do WinSCP"

source: "Uma entrada desconhecida (%1) foi encontrada no log da desinstalação"
glg: "Uma entrada descoñecida (%1) foi encontrada no log da desinstalação"

source: "Uma operação era tentada a um arquivo para o qual uma operação de exclusão está pendente."
glg: "Uma operação era tentada a un arquivo para o qual uma operação de exclusão está pendente."

source: "Uma senha para uma chave privada encriptada ou um certificado de cliente"
glg: "Uma contrasinal para uma chave privada encriptada ou un certificado de cliente"

source: "Upload dos arquivos selecionados em plano de fundo"
glg: "Carregar os arquivos selecionados en segundo plano"

source: "Upload em &Plano de fundo"
glg: "Carregar en Segundo &Plano"

source: "Upload|Carregar arquivos locais selecionados para pasta remota"
glg: "Carregar|Subir os arquivos locais selecionados ao cartafol remoto"

source: "Upload|Carregar os arquivos selecionados"
glg: "Carregar|Subir os arquivos seleccionados"

source: "Usando configurações de transferência diferentes do padrão de fábrica."
glg: "Usando configurações de transferencia diferentes do padrão de fábrica."

source: "Usar Fonte &Mono-espaçada"
glg: "Usar Fonte &Monoespazada"

source: "Usar as &mesmas configurações na próxima vez"
glg: "Usar as &mesmas configuracións na vindeira vez"

source: "Usar as me&smas opções na próxima vez"
glg: "Usar as me&smas opcións na vindeira vez"

source: "Usar comando &MLSD para listagem de pasta"
glg: "Usar comando &MLSD para listagem de cartafol"

source: "Usar editor padrão do sistema"
glg: "Usar editor por defecto do sistema"

source: "Usar este &diretório:"
glg: "Usar este &directorio:"

source: "Usar padrões de localização contidos no diretório de Favoritos"
glg: "Usar padrões de localização contidos no directorio de Favoritos"

source: "Valor desconhecido '%s' da opção '%s'."
glg: "Valor descoñecido '%s' da opção '%s'."

source: "Verificar por at&ualizações"
glg: "Comprobar act&ualizacións"

source: "Você deseja adicionar o caminho da aplicação '%s' ao caminho de busca do sistema (%%PATH%%)?"
glg: "Você desexa adicionar o camiño da aplicação '%s' ao camiño de busca do sistema (%%PATH%%)?"

source: "Você deseja limpar os dados armazenados pela aplicação neste computador?"
glg: "Você desexa limpar os dados armazenados pela aplicação neste computador?"

source: "Você deve estar logado como administrador ou como um membro do grupo de Usuários Power quando instalar este programa."
glg: "Você deve estar logado como administrador ou como un membro do grupo de Usuários Power quando instalar este programa."

source: "Você deve inserir um caminho completo com a letra do drive; por exemplo:\n\nC:\\APP\n\não um caminho UNC no formulário:\n\n\\\\server\\share"
glg: "Você deve inserir un camiño completo coa letra do drive; por exemplo:\n\nC:\\APP\n\não un camiño UNC no formulário:\n\n\\\\server\\share"

source: "Você deve inserir um nome de pasta."
glg: "Você deve inserir un nome de cartafol."

source: "Você deve inserir um nome."
glg: "Você deve inserir un nome."

source: "Você está editando um site.
glg: "Você está editando un site.

source: "Você está à um passo de usar uma tradução incompleta por apenas %1%1%%.\n\nPartes não traduzidas desta interface serão mostradas em sua versão original em Inglês.\n\nVisite o site do WinSCP em winscp.net para procurar, se uma nova versão da tradução está disponível."
glg: "Você está à un passo de usar uma tradução incompleta por apenas %1%1%%.\n\nPartes não traduzidas desta interface serão mostradas en sua versão original en Inglês.\n\nVisite o site do WinSCP en winscp.net para procurar, se uma nova versão da tradução está disponivel."

source: "Você não forneceu a Senha Mestra correta."
glg: "Você não forneceu a Contrasinal Mestra correta."

source: "Você não pode conectar à um servidor SFTP usando um protocolo FTP.
glg: "Você não pode conectar à un servidor SFTP usando un protocolo FTP.

source: "Você tem certeza que deseja apagar a pasta de sessão '%s' com %d sessão(ões)?"
glg: "Você tem certeza que desexa apagar a cartafol de sessão '%s' com %d sessão(ões)?"

source: "Você tem certeza que deseja excluir %d arquivos selecionados?"
glg: "Você tem certeza que desexa excluír %d arquivos selecionados?"

source: "Você tem certeza que deseja excluir o arquivo '%s'?"
glg: "Você tem certeza que desexa excluír o arquivo '%s'?"

source: "Você tem certeza que deseja mover o arquivo '%s' para a lixeira?"
glg: "Você tem certeza que desexa mover o arquivo '%s' para a lixeira?"

source: "Você tem certeza que deseja mover os %d arquivos selecionados para a lixeira?"
glg: "Você tem certeza que desexa mover os %d arquivos selecionados para a lixeira?"

source: "Você tem certeza que quer apagar o espaço de trabalho '%s' com %d sessões?"
glg: "Você tem certeza que quer apagar o espaço de traballo '%s' com %d sessões?"

source: "Você tem que especificar um arquivo chave de entrada."
glg: "Você tem que especificar un arquivo chave de entrada."

source: "Você tem que especificar um arquivo chave de saída."
glg: "Você tem que especificar un arquivo chave de saída."

source: "WinSCP é um cliente SFTP, SCP, Amazon S3, WebDAV e FTP para Windows."
glg: "WinSCP é un cliente SFTP, SCP, Amazon S3, WebDAV e FTP para Windows."

source: "WinSCP é um cliente popular e grátis de SFTP e FTP, um poderoso gerenciador de arquivos que aumentará sua produtividade.
glg: "WinSCP é un cliente popular e grátis de SFTP e FTP, un poderoso gerenciador de arquivos que aumentará sua produtividade.

source: "WinSCP é um cliente popular e grátis de SFTP e FTP.
glg: "WinSCP é un cliente popular e grátis de SFTP e FTP.

source: "WinSCP é um software livre: você pode usá-lo, redistribuí-lo e/ou modificá-lo sob os termos da GNU General Public License conforme publicaro pela Fundação Software Livre, seja a versão 3 da Licensa, ou (à sua escolha) qualquer licensa posterior."
glg: "WinSCP é un software livre: você pode usá-lo, redistribuí-lo e/ou modificá-lo sob os termos da GNU General Public License conforme publicaro pela Fundação Software Livre, sexa a versão 3 da Licensa, ou (à sua escolla) qualquer licensa posterior."

source: "call <comando>\n Com os protocolos SFTP e SCP, executa um comando remoto arbitrário.\n Se a sessão atual não permite a execução de comandos remotos arbitrários,\n uma sessão separada da Shell é aberta automaticamente.\n Com o protocolo FTP, executa um comando de protocolo.\n O comando não deve exigir entrada do usuário.\nalias:\n !\nexemplo:\n call touch index.html\n"
glg: "call <comando>\n Com os protocolos SFTP e SCP, executa un comando remoto arbitrário.\n Se a sessão atual não permite a execução de comandos remotos arbitrários,\n uma sessão separada da Shell é aberta automaticamente.\n Com o protocolo FTP, executa un comando de protocolo.\n O comando não deve exigir entrada do usuário.\nalias:\n !\nexemplo:\n call touch index.html\n"

source: "cd [ <diretório> ]\n Muda o diretório remoto de trabalho da sessão ativa.\n Se o diretório não for especificado, muda para o diretório home.\nexemplos:\n cd /home/martin\n cd\n"
glg: "cd [ <directorio> ]\n Muda o directorio remoto de traballo da sessão ativa.\n Se o directorio não for especificado, muda para o directorio home.\nexemplos:\n cd /home/martin\n cd\n"

source: "des/selecionar &tudo"
glg: "des/seleccionar &todo"

source: "esco&nder dicas"
glg: "ag&ochar suxestións"

source: "help [ <comando> [ ... ] ]\n Exibe a lista de comandos quando nenhum parâmetro é especificado.\n Exibe a ajuda para cada comando quando algum parâmetro é especificado.\nalias:\n man\nexemplos:\n help\n help ls\n"
glg: "help [ <comando> [ ... ] ]\n Exibe a lista de comandos quando neñum parâmetro é especificado.\n Exibe a axuda para cada comando quando algum parâmetro é especificado.\nalias:\n man\nexemplos:\n help\n help ls\n"

source: "lcd <diretório>\n Muda o diretório local de trabalho para todas as sessões.\nexemplo:\n lcd d:\\\n"
glg: "lcd <directorio>\n Muda o directorio local de traballo para todas as sessões.\nexemplo:\n lcd d:\\\n"

source: "ln <alvo> <link simbólico>\n Cria um link simbólico remoto.\nalias:\n symlink\nexemplo:\n ln /home/martin/public_html www\n"
glg: "ln <alvo> <link simbólico>\n Cria un link simbólico remoto.\nalias:\n symlink\nexemplo:\n ln /home/martin/public_html www\n"

source: "log em XML"
glg: "log en XML"

# "lpwd Exibe o diretório local de trabalho atual (válido para todas sessões). "
source: "lpwd\n Exibe o diretório local de trabalho atual (válido para todas sessões).\n"
glg: "lpwd\n Exibe o directorio local de traballo atual (válido para todas sessões).\n"

# "mkdir <diretório> Cria um diretório remoto. exemplo: mkdir public_html "
source: "mkdir <diretório>\n Cria um diretório remoto.\nexemplo:\n mkdir public_html\n"
glg: "mkdir <directorio>\n Cria un directorio remoto.\nexemplo:\n mkdir public_html\n"

# "pwd Exibe o diretório remoto de trabalho atual para a sessão ativa. "
source: "pwd\n Exibe o diretório remoto de trabalho atual para a sessão ativa.\n"
glg: "pwd\n Exibe o directorio remoto de traballo atual para a sessão ativa.\n"

# "rmdir <diretório> [ <diretório2> ... ] Remove um ou mais diretórios remotos.
source: "rmdir <diretório> [ <diretório2> ... ]\n Remove um ou mais diretórios remotos.
glg: "rmdir <directorio> [ ... ]\n Remove un ou mais directorios remotos.

# "sobre.html indice.html foto.jpg"
source: "sobre.html\r\nindice.html\r\nfoto.jpg"
glg: "sobre.html\r\nindice.html\r\nfoto.xpg"

source: "transferência segura de arquivo"
glg: "transferencia segura de arquivo"

source: "Área de trabalho"
glg: "Área de traballo"

source: "Árvore"
glg: "Árbore"

source: "Ícone do Shell da Pasta do Site"
glg: "Icona do Shell do Cartafol do Sitio"

source: "Ícone do Shell do Espaço de Trabalho"
glg: "Icona do Shell do Espazo de Traballo"

source: "Ícone do Shell do Site"
glg: "Icona do Shell do Sitio"

source: "Ícones &Grandes"
glg: "Iconas &Grandes"

source: "Ícones &Pequenos"
glg: "Iconas &Pequenas"

source: "Ícones Grandes|Exibir ícones grandes"
glg: "Iconas Grandes|Amosar iconas grandes"

source: "Ícones do Shell"
glg: "Icona do Shell"

source: "Ícones pequenos|Exibir ícones pequenos"
glg: "Iconas pequenas|Amosar iconas pequenas"

source: $$\n \nPressione 'Delete' para apagar o arquivo e criar um novo em vez de sobrescrevê-lo.$$"
glg: $$\n \nPressione 'Delete' para apagar o arquivo e criar un novo en vez de sobrescrevê-lo.$$"

source: (Ao pressionar 'Não' você ativará o comportamento especial e deixará o arquivo no diretório temporário.)"
glg: (Ao pressionar 'Não' você ativará o comportamento especial e deixará o arquivo no directorio temporário.)"

source: A sintaxe da linha de comando provavelmente está errada."
glg: A sintaxe da liña de comando provavelmente está errada."

source: Adicione o curinga * para selecionar todos os arquivos na pasta."
glg: Adicione o curinga * para selecionar todos os arquivos na cartafol."

source: Administradores amam o suporte do WinSCP à operações portáteis usando uma configuração em vez de arquivos de registro, ótimo para operações à partir de mídias removíveis.
glg: Administradores amam o suporte do WinSCP à operações portáteis usando uma configuração en vez de arquivos de registro, ótimo para operações à partir de mídias removíveis.

source: Altere as configurações de terminal de um site temporário %s.
glg: Altere as configurações de terminal de un site temporário %s.

source: Alternativamente, o mesmo número de arquivos pode ser selecionado em ambos os painéis, de modo a executar o comando para pares de arquivos."
glg: Alternativamente, o mesmo número de arquivos pode ser selecionado en ambos os painéis, de modo a executar o comando para pares de arquivos."

source: Após conectar à um site você pode optar por armazenar as informações do site para acessos posteriores, o WinSCP pode ainda compartilhar configurações de site com outra ferramenta open source PuTTY.
glg: Após conectar à un site você pode optar por armazenar as informações do site para acessos posteriores, o WinSCP pode ainda compartillar configurações de site coutra ferramenta open source PuTTY.

source: As mudanças serão perdidas, se o arquivo for recarregado.
glg: As mudanzas serão perdidas, se o arquivo for recarregado.

source: As senhas são caso-sensitivo."
glg: As contrasinals são caso-sensitivo."

source: Clicar em Cancelar é a ÚNICA decisão segura."
glg: Clicar en Cancelar é a ÚNICA decisão segura."

source: Clique em Próximo quando você estiver pronto pra continuar."
glg: Clique en Próximo quando você estiver pronto pra continuar."

source: Clique no botão Ajuda para maiores informações."
glg: Clique no botão Axuda para maiores informações."

source: Considere usar um editor externo capaz de editar arquivos grandes.\n\nVocê pode tentar abrir o arquivo assim mesmo, mas você pode ficar sem memória."
glg: Considere usar un editor externo capaz de editar arquivos grandes.\n\nVocê pode tentar abrir o arquivo assim mesmo, mas você pode ficar sem memória."

source: De um lado, WinSCP oferece uma interface gráfica fácil de usar; você pode escolher entre a aparência do Windows Explorer e um painel duplo com abas, tipo o commander do Norton.
glg: De un lado, WinSCP oferece uma interface gráfica fácil de usar; você pode escoller entre a aparência do Windows Explorer e un painel duplo com abas, tipo o commander do Norton.

source: Deseja Criar?"
glg: Desexa Criar?"

source: Deseja Sobrescrever?"
glg: Desexa Sobrescrever?"

source: Deseja continuar?"
glg: Desexa continuar?"

source: Deseja salvar as mudanças?"
glg: Desexa gardar as mudanzas?"

source: Deseja sobrescrever?"
glg: Desexa sobrescrever?"

source: Do outro lado, usuários avançados podem automatizar as funcionalidades do WinSCP usando a assembly .NET ou um simples script batch.
glg: Do outro lado, usuários avançados podem automatizar as funcionalidades do WinSCP usando a assembly .NET ou un simples script batch.

source: Duplo-clique para fazer a arvore de diretórios em tamanho igual."
glg: Duplo-clique para fazer a arvore de directorios en tamaño igual."

source: Duplo-clique para ocultar a lista de espera"
glg: Dobre-clic para agochar a lista de agarda"

source: Duplo-clique para ocultar a árvore de diretórios."
glg: Duplo-clique para agochar a árvore de directorios."

source: Ela deve ser digitada em formato hexadecimal (ex.
glg: Ela deve ser digitada en formato hexadecimal (ex.

source: Ela não permite seguir sua versão escolhida do protocolo SSH."
glg: Ela não permite seguir sua versão escollida do protocolo SSH."

source: Esperando respost...\n\nNota: se este problema se repetir, tente desligar a opção 'Otimizar tamanho do buffer de conexão'."
glg: Esperando respost...\n\nNota: se este problema se repetir, tente desligar a opção 'Otimizar tamaño do buffer de conexão'."

source: Esse site hospedage também um fórum de usuário muito ativo para pedidos de ajuda e sugestões.
glg: Esse site hospedage também un fórum de usuário muito ativo para pedidos de axuda e sugestões.

source: Estas pastas podem conter arquivos editados ou baixados anteriormente.\n\nVocê pode também abrir as pastas para revisra seus conteúdos e para deletar você mesmo."
glg: Estas cartafoles podem conter arquivos editados ou baixados anteriormente.\n\nVocê pode também abrir as cartafoles para revisra seus conteúdos e para deletar você mesmo."

source: Este comportamento pode ser ligado desmarcando a opção de configuração do editor 'Editor externo abre cada arquivo em uma janela separada (processo)'.
glg: Este comportamento pode ser ligado desmarcando a opção de configuração do editor 'Editor externo abre cada arquivo en uma xanela separada (processo)'.

source: Instâncias adicionais da aplicação apenas enviam o novo arquivo para a instância já existente e se fecha imediatamente.
glg: Instâncias adicionais da aplicação apenas enviam o novo arquivo para a instância xá existente e se fecha imediatamente.

source: Isso lhe permite arrastar e soltar arquivo para qualquer destino."
glg: Isso lle permite arrastar e soltar arquivo para qualquer destino."

source: Isso significa que o administrador do servidor alterou a chave de host, o servidor apresenta chaves diferentes em determinadas circunstâncias, ou que você está conectando-se a outro computador fingindo ser o servidor.\n\nOs novos detalhes da chave %s são:\n\n%s\n\nSe você esperava esta mudança, confia na nova chave e deseja continuar a conexão ao servidor, clique em Atualizar para atualizar o cache, ou clique em Adicionar para adicionar a nova chave para o cache enquanto mantém a chave anterior.
glg: Isso significa que o administrador do servidor alterou a chave de host, o servidor apresenta chaves diferentes en determinadas circunstâncias, ou que você está conectando-se a outro computador fingindo ser o servidor.\n\nOs novos detalles da chave %s são:\n\n%s\n\nSe você esperava esta mudança, confia na nova chave e desexa continuar a conexão ao servidor, clique en Atualizar para atualizar o cache, ou clique en Adicionar para adicionar a nova chave para o cache enquanto mantém a chave anterior.

source: Mudanças serão perdidas, se o arquivo for recarregado usando codificação diferente.
glg: Mudanças serão perdidas, se o arquivo for recarregado usando codificación diferente.

source: Normalmente arquivos somente-leitura não são sobrescritos e quaisquer mudanças na configuração são perdidas quando o WinSCP é fechado."
glg: Normalmente arquivos somente-leitura não são sobrescritos e quaisquer mudanzas na configuração são perdidas quando o WinSCP é fechado."

source: Não há garantia de que o servidor é o computador que você pensa que é.\n\nOs detalhes da chave do servidor %s são:\n\n%s\n\nSe você confia neste host, clique em Sim.
glg: Não há garantia de que o servidor é o computador que você pensa que é.\n\nOs detalles da chave do servidor %s são:\n\n%s\n\nSe você confia neste host, clique en Sim.

source: Não permite downloads para outros destinos (arquivos ZIP, FTP, etc.).
glg: Não permite descárregas para outros destinos (arquivos ZIP, FTP, etc.).

source: Nós recomendamos que você converta sua chave para um novo formato.\n\nVocê pode realizar esta conversão carregando sua chave no PuTTYgen e salvando-a novamente."
glg: Nós recomendamos que você converta sua chave para un novo formato.\n\nVocê pode realizar esta conversão carregando sua chave no PuTTYgen e salvando-a novamente."

source: O WinSCP está disponível em Inglês e muitos outros idiomas."
glg: O WinSCP está disponivel en Inglês e muitos outros idiomas."

source: O WinSCP está disponível em inglês e muitos outros idiomas.
glg: O WinSCP está disponivel en inglês e muitos outros idiomas.

source: O WinSCP oferece diversas maneiras de sincronizar suas pastas locais e remotas.
glg: O WinSCP oferece diversas maneiras de sincronizar suas cartafoles locais e remotas.

source: O WinSCP pode suportar este tipo de aplicação somente como editor externo.\n \nSe você deseja usar a aplicação para abrir arquivos do WinSCP, considere configurá-la como um editor externo."
glg: O WinSCP pode suportar este tipo de aplicação somente como editor externo.\n \nSe você desexa usar a aplicação para abrir arquivos do WinSCP, considere configurá-la como un editor externo."

source: O aplicativo pode ser iniciado selecionando os atalhos instalados."
glg: O aplicativo pode ser iniciado selecionando os atallos instalados."

source: O endereço é de um servidor SFTP?"
glg: O endereço é de un servidor SFTP?"

source: O tamanho máximo do pacote suportado é %d B."
glg: O tamaño máximo do pacote suportado é %d B."

source: Os arquivos serão baixados para um diretório temporário antes de seguirem ao seu destino."
glg: Os arquivos serão baixados para un directorio temporário antes de seguirem ao seu destino."

source: Os parâmetros que você especificou na linha de comando não serão usados.
glg: Os parâmetros que você especificou na liña de comando não serão usados.

source: Para abortar a conexão clique em Cancelar."
glg: Para abortar a conexão clique en Cancelar."

source: Para conectar-se sem adicionar a chave de host ao cache, clique em Não.
glg: Para conectar-se sem adicionar a chave de host ao cache, clique en Não.

source: Por favor clique em Cancelar pra sair."
glg: Por favor clique en Cancelar pra sair."

source: Por favor corrija o problema ou obtenha uma nova cópia do programa."
glg: Por favor corrixa o problema ou obteña uma nova cópia do programa."

source: Por favor insira o disco correto ou selecione outra pasta."
glg: Por favor insira o disco correto ou selecione outra cartafol."

source: Por favor obtenha uma nova cópia do programa."
glg: Por favor obteña uma nova cópia do programa."

source: Por favor tente novamente mais tarde ou veja a Ajuda."
glg: Por favor tente novamente mais tarde ou vexa a Axuda."

source: Por favor, cheque se a mensagem não contém nenhuma informação que deseja proteger, como nomes de arquivos, contas ou hosts.."
glg: Por favor, cheque se a mensagem não contém neñuma informação que desexa proteger, como nomes de arquivos, contas ou hosts.."

source: Por favor, feche-os antes de sair da aplicação.\n \nCuidado: Se você ignorar esta mensagem, os arquivos abertos pode permanecer no diretório temporário."
glg: Por favor, feche-os antes de sair da aplicação.\n \nCuidado: Se você ignorar esta mensagem, os arquivos abertos pode permanecer no directorio temporário."

source: Procurar por mudanças em um grande número de diretórios pode degradar severamente a performancedo computador.\n \nVocê deseja procurar por mudanças nos outros %d diretórios?"
glg: Procurar por mudanzas en un grande número de directorios pode degradar severamente a performancedo computador.\n \nVocê desexa procurar por mudanzas nos outros %d directorios?"

source: Propriedades"
glg: Propiedades"

source: Quando um número de sessão não é\n especificado, fecha a sessão selecionada atualmente.\nexemplos:\n close\n close 1\n"
glg: Quando un número de sessão não é\n especificado, fecha a sessão seleccionada atualmente.\nexemplos:\n close\n close 1\n"
